<a href="https://colab.research.google.com/github/profliuhao/CSIT355/blob/main/CSIT_355_Module_7_Views_lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab 7: Views

### [name]
### [student ID]

## Instruction
You need to finish all questions of In-class exercises. Name your ipynb file as StudentName_lab7.ipynb and download it. And then submit it on Canvas.

PLEASE ENSURE THAT THE SCRIPT CAN CORRECTLY EXECUTE!!!

In [ ]:
#Let's connect to a database **lab7.db** using:
%load_ext sql
#%reload_ext sql
%sql sqlite:///lab7.db

We will continue to use the following three tables.

1. Employee(<u>eid</u>:integer, ename:string, age:integer, salary:real)

2. Works(<u>eid</u>:integer, <u>did</u>:integer, pct_time:integer)

3. Department(<u>did</u>:integer, dname:string, budge:real, managerid:integer)

The keys are underlined in each relation. Relation **Employee** stores employee information such as unique identifier **eid**, employee name **ename**, **age** and **salary**. Relation **Department** stores the department unique identifier **did**, department name **dname**, the department **budget** and **managerid** which is the **eid** of the employee who is managing the department. The **managerid** value must always be found in the **eid** field of a record of the Employee relation. The Works relation tracks which
employee works in which department, and what **percentage** of the time s/he allocates to that department. Note that, an employee can work in several departments.

In [ ]:
%%sql
CREATE TABLE Employee (eid integer PRIMARY KEY,
                       ename varchar(20),
                       age integer,
                       salary number(8,2));
CREATE TABLE Department (did integer PRIMARY KEY,
                         dname varchar(20),
                         budget number(8,2),
                         managerid integer,
                         FOREIGN KEY (managerid) REFERENCES Employee(eid));
CREATE TABLE Works (eid integer,
                    did integer,
                    pct_time integer,
                    PRIMARY KEY(eid, did),
                    FOREIGN KEY (eid) REFERENCES Employee,
                    FOREIGN KEY (did) REFERENCES Department);

 * sqlite:///lab7.db
Done.
Done.
Done.

[]


1. Employee

| eid     | ename         | age | salary |  
|---------|---------------|-----|--------|
| 101     | Andrew Fuller | 40  | 50000  |
| 102     | Justin Peacock| 25  | 15000  |
| 103     | Nancy Buchanan| 35  | 30000  |
| 104     | Robert King   | 30  | 20000  |
| 104     | Emma Stone    | 55  | 90000  |

2. Works:

| eid     | did  | pct_time |
|---------|------|----------|
| 101     | 1001 | 100      |
| 102     | 1001 | 20       |
| 102     | 1002 | 50       |
| 102     | 1003 | 10       |
| 103     | 1003 | 90       |
| 103     | 1001 | 10       |
| 104     | 1001 | 20       |
| 104     | 1002 | 70       |
| 104     | 1002 | 100       |

3. Department:

| did     | dname    | budget  | managerid |
|---------|----------|---------|-----------|
| 1001    | IT       | 500000  | 101       |
| 1002    | Computing| 750000  | 110       |
| 1003    | Finance  | 350000  | 103       |

In [ ]:
%%sql
DELETE FROM Employee;
DELETE FROM Works;
DELETE FROM Department;
insert into Employee values ( 101,'Andrew Fuller', 40, 50000);
insert into Employee values ( 102, 'Justin Peacock', 25, 20000);
insert into Employee values ( 103, 'Nancy Buchanan', 35, 30000);
insert into Employee values ( 104, 'Robert King', 30, 20000);
insert into Employee values ( 110, 'Emma Stone', 55, 90000);

insert into Department values (1001, 'IT', 500000, 101);
insert into Department values (1002, 'Computing', 750000, 110);
insert into Department values (1003, 'Finance', 350000, 103);

insert into Works values (101, 1001, 100);
insert into Works values (102, 1001, 20);
insert into Works values (102, 1002, 50);
insert into Works values (102, 1003, 10);
insert into Works values (103, 1003, 90);
insert into Works values (103, 1001, 10);
insert into Works values (104, 1001, 20);
insert into Works values (104, 1002, 70);
insert into Works values (110, 1002, 100);

 * sqlite:///lab7.db
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%sql Select * from Employee

 * sqlite:///lab7.db
Done.

[(101, 'Andrew Fuller', 40, 50000),
 (102, 'Justin Peacock', 25, 20000),
 (103, 'Nancy Buchanan', 35, 30000),
 (104, 'Robert King', 30, 20000),
 (110, 'Emma Stone', 55, 90000)]

In [ ]:
%sql Select * from Works

 * sqlite:///lab7.db
Done.

[(101, 1001, 100),
 (102, 1001, 20),
 (102, 1002, 50),
 (102, 1003, 10),
 (103, 1003, 90),
 (103, 1001, 10),
 (104, 1001, 20),
 (104, 1002, 70),
 (110, 1002, 100)]

In [ ]:
%sql Select * from Department

 * sqlite:///lab7.db
Done.

[(1001, 'IT', 500000, 101),
 (1002, 'Computing', 750000, 110),
 (1003, 'Finance', 350000, 103)]

## In-class Assignment

### Exercise 1
Create a view named "FullTimeEmployees" that displays employee names and their departments for employees who work 100% of time in a single department(pct_time = 100).

In [ ]:
%%sql

Drop view if exists FullTimeEmployees;

-- your answer here

 * sqlite:///lab7.db
Done.
Done.

[]

In [ ]:
%%sql
select * from FullTimeEmployees;

 * sqlite:///lab7.db
Done.

[('Andrew Fuller', 'IT'), ('Emma Stone', 'Computing')]

### Exercise 2  
Create a view named "EmployeeStats" that displays the average salary, minimum age, and maximum age for each department. Include departments with at least two employees.

In [ ]:
%%sql
Drop view if exists EmployeeStats;

-- your answer here

 * sqlite:///lab7.db
Done.
Done.

[]

In [ ]:
%%sql
select * from EmployeeStats;

 * sqlite:///lab7.db
Done.

[('Computing', 90000.0, 55, 55),
 ('Finance', 30000.0, 35, 35),
 ('IT', 50000.0, 40, 40)]

### Exercise 3
Create a view named "DepartmentPerformance" that displays the average salary and the total number of employees in each department that the every employee is younger than or equal to 35.

In [ ]:
%%sql
Drop view if exists DepartmentPerformance;

-- your answer here

 * sqlite:///lab7.db
Done.
Done.

[]

In [ ]:
%%sql
select * from DepartmentPerformance;

 * sqlite:///lab7.db
Done.

[('Finance', 25000.0, 2)]